# ConcreteBumpMap Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Concrete..::..ConcreteBumpMap Property
Concrete Class See Also
---
The property labeled "Image" from the "Concrete" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string ConcreteBumpMap { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ConcreteBumpMap As String
	Get
```

Visual C++
---
```text
public:
static property String^ ConcreteBumpMap {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
# See Also
Concrete Class
Autodesk.Revit.DB.Visual Namespace